package com.bulatov.bulatov_lesson_5.ActivitySixty

import android.graphics.Color
import com.bulatov.bulatov_lesson_5.R

class ItemContent {
    fun addListInfoItem(): List<Item> =
        listOf(
            Item("Царь пышка", "Скидка 10% на выпечку по коду", R.color.black,"Лермонтовский пр, 52, МО №1"),
            Item("Химчистка «МАЙ?»", "Скидка 5% на чистку пальто", R.color.teal_200,"Лермонтовский пр, 48"),
            Item("Шаверма У Ашота ", "При покупке шавермы, фалафель бесплатно", R.color.purple_700,"Лермонтовский пр, 52, МО №1"),
                    Item("Царь пышка", "Скидка 10% на выпечку по коду", R.color.black,"Лермонтовский пр, 52, МО №1"),
    Item("Химчистка «МАЙ?»", "Скидка 5% на чистку пальто", R.color.teal_200,"Лермонтовский пр, 48"),
    Item("Шаверма У Ашота ", "При покупке шавермы, фалафель бесплатно", R.color.purple_700,"Лермонтовский пр, 52, МО №1"),
            Item("Царь пышка", "Скидка 10% на выпечку по коду", R.color.black,"Лермонтовский пр, 52, МО №1"),
            Item("Химчистка «МАЙ?»", "Скидка 5% на чистку пальто", R.color.teal_200,"Лермонтовский пр, 48"),
            Item("Шаверма У Ашота ", "При покупке шавермы, фалафель бесплатно", R.color.purple_700,"Лермонтовский пр, 52, МО №1"),
            Item("Царь пышка", "Скидка 10% на выпечку по коду", R.color.black,"Лермонтовский пр, 52, МО №1"),
            Item("Химчистка «МАЙ?»", "Скидка 5% на чистку пальто", R.color.teal_200,"Лермонтовский пр, 48"),
            Item("Шаверма У Ашота ", "При покупке шавермы, фалафель бесплатно", R.color.purple_700,"Лермонтовский пр, 52, МО №1")
        )
}